Revit 2027 API
MassInstanceUtils Methods
The MassInstanceUtils type exposes the following members.
Methods
Name | Description
AddMassLevelDataToMassInstance |  Create a MassLevelData (Mass Floor) to associate a Level with a mass instance.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetGrossFloorArea |  Get the total occupiable floor area represented by a mass instance.
GetGrossSurfaceArea |  Get the total exterior building surface area represented by a mass instance.
GetGrossVolume |  Get the total building volume represented by a mass instance.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetJoinedElementIds |  Get the ElementIds of Elements that are joined to a mass instance.
GetMassLevelDataIds |  Get the ElementIds of the MassLevelDatas (Mass Floors) associated with a mass instance.
GetMassLevelIds |  Get the ElementIds of the Levels associated with a mass instance.
GetType | Gets the Type of the current instance.
(Inherited from Object)
RemoveMassLevelDataFromMassInstance |  Delete the MassLevelData (Mass Floor) that associates a Level with a mass instance.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
MassInstanceUtils Class
Autodesk.Revit.DB Namespace